Repository: samuel-toth/finfo-app
Catalog: lib/l10n/app_*.arb
Languages: sk

source: Stocks
sk: Akcie

# cryptos
source: Cryptocurrencies
sk: Kryptomeny

source: Home
sk: Domov

source: Portfolio
sk: Portfólio

source: News
sk: Novinky

source: Search
sk: Hľadať

# searchWord
source: Search...
sk: Hľadať...

# removeCrypto
source: Remove cryptocurrency
sk: Vymazať kryptomenu

# removeStock
source: Remove stocks
sk: Vymazať akcie

# addNewCrypto
source: Add new cryptocurrency
sk: Pridať novú kryptomenu

# addNewStock
source: Add new stocks
sk: Pridať nové akcie

# nameCryptocurrency
source: Name for your crypto investment
sk: Meno pre Vašu novú krypto investíciu

# nameStock
source: Name for your stock investment
sk: Meno pre Vašu novú investíciu

# amountCryptocurrency
source: Amount of your cryptocurrency
sk: Množstvo vašej kryptomeny

# amountStock
source: Number of your shares
sk: Množstvo Vašich akcií

# noInvestment
source: You did not add any investment
sk: Nepridali ste ešte žiadne investície

# cryptoWalletOptional
source: Cryptocurrency wallet (Optional)
sk: Číslo Vašej krypto peňaženky (Voliteľné)

# addFavourites
source: Add to favourites?
sk: Pridať do obľúbených

# addPortfolio
source: Add to portfolio
sk: Pridať do portfólia

# enterName
source: Please, enter name
sk: Prosím, zadajte meno

# enterPositiveNumber
source: Please, enter positive number
sk: Prosím, zadajte kladné číslo

# enterNumberSmaller
source: Number must be smaller than no. of shares
sk: Číslo musí byť menšie než aktuálny počet

# enterValidNumber
source: Please, enter valid number
sk: Prosím, zadajte správne číslo

# enterAmount
source: Please, enter the amount
sk: Prosím, zadajte množstvo

# pinnedInvestments
source: Favourite Investments
sk: Obľúbené investície

# noPinned
source: You have no pinned investments
sk: Nepripli ste žiadne investície

source: Balance
sk: Zostatok

source: Settings
sk: Nastavenia

source: Choose currency
sk: Preferovaná mena

# deleteAllCryptos
source: Delete all cryptocurrencies from portfolio
sk: Vymazať všetky kryptomeny z portfólia

# deleteAllStocks
source: Delete all stocks from portfolio
sk: Vymazať všetky akcie z portfólia

source: Market Statistics
sk: Trhové štatistiky

source: Price
sk: Cena

# marketCapRank
source: Market capital rank
sk: Poradie na trhu

# marketCap
source: Market capital
sk: Trhový kapitál

source: Circulating supply
sk: Množstvo v obehu

source: Max supply
sk: Maximálne množstvo

source: All time high
sk: Najvyššia hodnota

# somethingWrong
source: Something went wrong. Please check your internet connection and try later
sk: Niečo je zle. Prosím, skontrolujte svoje internetové pripojenie a skúste neskôr

source: Company Statistics
sk: Firemné štatistiky

source: CEO
sk: Riaditeľ

source: Employees
sk: Zamestnanci

source: Sector
sk: Sektor

source: No history
sk: Žiadna história

source: Business
sk: Biznis

source: Stock market
sk: Akciový trh

source: Technology
sk: Technológie

# openBrowser
source: Open in browser
sk: Otvoriť v prehliadači

# addMoreCrypto
source: Add more cryptocurrency
sk: Pridať do kryptomeny

source: Amount of
sk: Množstvo

# amountShares
source: shares
sk: akcií

source: Confirm
sk: Potvrdiť

source: Cancel
sk: Zrušiť

# removeFromCrypto
source: Remove from cryptocurrency
sk: Odobrať z kryptomeny

source: Add more stock
sk: Pridať akcie

source: Remove from stock
sk: Odobrať z akcií

source: Load more
sk: Načitať ďaľšie

# chooseNews
source: Choose news category
sk: Preferované správy

source: History
sk: História

source: Loading
sk: Načitávam

source: Search available stocks
sk: Vyhľadať dostupné akcie

# searchAvailableCryptos
source: Search available stocks
sk: Vyhľadať dostupné kryptomeny

# selectStock
source: Please, select a stock
sk: Prosím, vyberte akciu

# selectCrypto
source: Please, select a cryptocurrency
sk: Prosím, vyberte kryptomenu

# validateWalletNumber
source: Wallet must be between 25 and 35 symbols
sk: Číslo peňaženky musí mať 25 až 35 znakov

# validateNameLength
source: Name must have less than 25 characters
sk: Meno môže mať najviac 25 znakov

source: Next
sk: Ďalej

source: Previous
sk: Naspäť

source: Sort by
sk: Zoradiť podľa

source: Market rank
sk: Poradie na trhu

source: Highest price
sk: Najvyššia cena

source: Lowest price
sk: Najnižšia cena

# highestChange
source: Highest gain
sk: Najväčší zisk

source: Highest lose
sk: Najväčšia strata

source: Followed news
sk: Sledované novinky

source: Most active
sk: Najaktívnejšie

source: Gainers
sk: Rastúce

source: Losers
sk: Klesajúce

# selectSupportedCrypto
source: Select supported cryptocurrency
sk: Vyberte podporovanú kryptomenu

# selectSupportedStock
source: Select supported cryptocurrency
sk: Vyberte podporované akcie

# noGraphData
source: Unfortunately, there are no data
sk: Žiaľ, nie sú dostupné žiadne data

# numberLarger
source: Enter number larger than no. of shares
sk: Zadajte číslo väčšie než počet akcií

# noInternet
source: No internet connection
sk: Žiadne internetové pripojenie

source: Exchange
sk: Prepočeť

# noArticles
source: No articles founded
sk: Nenašli sa žiadne správy

# at
source: on
sk: dňa
